#include "lib.h"

/*************************************************************************
* exit系统调用接口函数，提供给用户程序
*************************************************************************/
int exit(int error_code)
{
 	int __rtn;
 	__asm{
 		mov	r0, error_code
 		swi	__NR_exit
 		mov	__rtn, r0
 	}
 	return __rtn;
}

/*************************************************************************
* sleep系统调用接口函数，提供给用户程序
*************************************************************************/
int sleep(int time)
{
 	int __rtn;
 	__asm{
 		mov	r0, time
 		swi	__NR_sleep
 		mov	__rtn, r0
	}
	return __rtn;
}

/**************************************************************
* write系统调用接口函数，提供给用户程序
***************************************************************/
int write(char *str)
{
 	int __rtn;
 	__asm{
 		mov	r0, str
 		swi	__NR_write
 		mov	__rtn, r0
	}
	return __rtn;
}

/**************************************************************
* led_on系统调用接口函数，提供给用户程序
***************************************************************/
int led_on(int led_no)
{
 	int __rtn;
 	__asm{
 		mov	r0, led_no
 		swi	__NR_led_on
 		mov	__rtn, r0
	}
	return __rtn;
}

/**************************************************************
* all_led_off系统调用接口函数，提供给用户程序
***************************************************************/
void all_led_off(void)
{
 	__asm{
 		swi	__NR_all_led_off
	}
}

/**************************************************************
* all_led_on系统调用接口函数，提供给用户程序
***************************************************************/
void all_led_on(void)
{
 	__asm{
 		swi	__NR_all_led_on
	}
}

